13/data/attachments/a154421f16e56c94.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>John_least_Friend_45975_8</nif:username>
            <nif:friendToBeRequested>soap_friends_c482c75b-b9de-471f-83dd-c24497df9ffd</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>